public class Class26 {//циклы
    //26. Вывести на экран соответствий между символами и их численными обозначениями в памяти
    //компьютера (Таблицу ASCII).

    public void task26(){

        for(int i=33; i<127; i++){
            System.out.print(i+" -->  ");
            System.out.println((char)i);

        }

    }
}
